<?php
error_reporting(0);
require_once "function/function.php";
date_default_timezone_set("Asia/Tehran");

@$license = '[*license*]'; // کد لایسنس شما
@$Token = '[*token*]'; // توکن ربات
@$admins = ['[*admin*]']; // ایدی عددی ادمین ربات
// اطلاعات دیتابیس ربات
@$localhost     = 'localhost'; // درصورت نیاز تغییر دهید
@$db_name       = '[*db_name*]'; // نام دیتابیس
@$db_username   = '[*db_username*]'; // یوزر دیتابیس
@$db_password   = '[*db_password*]'; // رمز یوزر دیتابیس
//---------اطلاعات وب سرویس------------//


@$mindeposit = '1000'; // حداقل مبلغ برای واریز به تومان
@$maxdeposit = '1000000'; // حداکثر مبلغ برای واریز به تومان

@$mintomovebalnce = '1000'; // حداقل موجودی هدیه برای انتقال به موجودی اصلی
@$minwithdrawbalance = '10000'; // حداقل موجودی برای درخواست برداشت به حساب بانکی
//----------مقادیر زیر به صورت بهترین شیوه ممکن تنظیم شده اند درصورت نیاز به تغییرات با پشتیبانی هماهنگ کنید------//
//----------ادرس دامنه و فولدر-----------//
@$domin = domin(); // درصورت بروز مشکل تغییر دهید
//برای مثال خط بالا رو به صورت زیر بنویسید
//@$domin = "site.com/bot";
//----------تعداد سفارش در هربار بررسی------------//

@$numordercheck = 100; // درصورت نیاز تغییر دهید

//----------تعداد  فوروارد همگانی در هرسری---------//

@$countformin = 30; // درصورت نیاز تغییر دهید

// محدودیت تلگرام برای فوروارد 2000 فوروارد در هرساعت
//----------تعداد پیام همگانی در هرسری---------//

@$countsendmin = 100; // درصورت نیاز تغییر دهید

// محدودیت تلگرام برای ارسال پیام و غیره 30 درخواست در هر ثانیه
?>